// TM No. -> ItemID(Gen4)
export const tmGen4IDs = [
  10000, // なし
  328, // わざマシン01
  329, // わざマシン02
  330, // わざマシン03
  331, // わざマシン04
  332, // わざマシン05
  333, // わざマシン06
  334, // わざマシン07
  335, // わざマシン08
  336, // わざマシン09
  337, // わざマシン10
  338, // わざマシン11
  339, // わざマシン12
  340, // わざマシン13
  341, // わざマシン14
  342, // わざマシン15
  343, // わざマシン16
  344, // わざマシン17
  345, // わざマシン18
  346, // わざマシン19
  347, // わざマシン20
  348, // わざマシン21
  349, // わざマシン22
  350, // わざマシン23
  351, // わざマシン24
  352, // わざマシン25
  353, // わざマシン26
  354, // わざマシン27
  355, // わざマシン28
  356, // わざマシン29
  357, // わざマシン30
  358, // わざマシン31
  359, // わざマシン32
  360, // わざマシン33
  361, // わざマシン34
  362, // わざマシン35
  363, // わざマシン36
  364, // わざマシン37
  365, // わざマシン38
  366, // わざマシン39
  367, // わざマシン40
  368, // わざマシン41
  369, // わざマシン42
  370, // わざマシン43
  371, // わざマシン44
  372, // わざマシン45
  373, // わざマシン46
  374, // わざマシン47
  375, // わざマシン48
  376, // わざマシン49
  377, // わざマシン50
];

// HM No. -> ItemID(Gen4)
export const hmGen4IDs = [
  10000, // なし
  420, // ひでんマシン01
  421, // ひでんマシン02
  422, // ひでんマシン03
  423, // ひでんマシン04
  424, // ひでんマシン05
  425, // ひでんマシン06
  737, // ひでんマシン07
  30013, // ひでんマシン08
];
